{
  "projects": [
    {
      "slug": "studyap",
      "name": "StudyAP",
      "tagline": "Free AP exam prep platform serving 10K+ students",
      "stack": ["React", "Next.js", "TypeScript", "PostgreSQL", "Vercel"],
      "year": "2023-2024",
      "role": "Founder & Lead Developer",
      "description": "Built a comprehensive platform providing free study materials, practice questions, and exam strategies for AP students. Grew organically to 10,000+ active users through word-of-mouth and community engagement.",
      "highlights": [
        "Designed and implemented adaptive quiz engine with 2,000+ practice questions across 8 AP subjects",
        "Built analytics dashboard showing student progress, weak areas, and study recommendations",
        "Achieved 95+ Lighthouse scores across all metrics with optimized SSR and image delivery",
        "Implemented real-time collaboration features for study groups using WebSockets",
        "Created content management system for educators to contribute and review materials"
      ],
      "metrics": [
        "10,000+ practice questions",
        "10+ subjects covered",
        "1,500+ unique visitors"
      ],
      "links": {
        "demo": "https://studyap.org",
        "repo": "https://github.com/gxu0904/sss"
      }
    },
    {
      "slug": "lightaid",
      "name": "LightAid Lead",
      "tagline": "Internal automation tools reducing manual work by 70%",
      "stack": ["Python", "FastAPI", "React", "PostgreSQL", "AWS Lambda"],
      "year": "2023",
      "role": "Operations Engineer",
      "description": "Developed suite of internal tools to automate repetitive workflows at LightAid, a nonprofit providing solar solutions to underserved communities. Focused on inventory management, donor tracking, and deployment logistics.",
      "highlights": [
        "Built inventory management system tracking 5,000+ solar units across multiple warehouses",
        "Automated donor reporting pipeline, reducing report generation time from 4 hours to 5 minutes",
        "Created deployment planning tool optimizing logistics for 100+ installations per month",
        "Integrated Slack notifications and alerts for critical inventory and deployment events",
        "Implemented role-based access control and audit logging for compliance"
      ],
      "metrics": [
        "70% reduction in manual workflows",
        "5,000+ units tracked",
        "4hrs → 5min report generation",
        "100+ deployments/month optimized"
      ],
      "links": {
        "repo": "https://github.com/gxu0904/lightaid-ops"
      }
    },
    {
      "slug": "frc-robotics",
      "name": "FRC Team 3256 Warriorborgs Robot Code",
      "tagline": "Real-time robot performance analytics for competitive robotics",
      "stack": ["React Native", "Firebase", "TypeScript", "Python", "TensorFlow"],
      "year": "2022-2023",
      "role": "Lead Developer",
      "description": "Mobile-first scouting application for FIRST Robotics Competition teams to collect, analyze, and visualize robot performance data during competitions. Used by 50+ teams at regional and championship events.",
      "highlights": [
        "Designed offline-first architecture with Firebase sync for reliable data collection in poor network conditions",
        "Built statistical models predicting match outcomes with 78% accuracy using historical performance data",
        "Created intuitive data entry interface reducing scout training time from 2 hours to 15 minutes",
        "Implemented real-time match strategy recommendations based on alliance partner analysis",
        "Exported data visualizations and reports for strategy meetings and alliance selections"
      ],
      "metrics": [
        "50+ teams using system",
        "78% match prediction accuracy",
        "15min scout training time",
        "2,000+ matches analyzed"
      ],
      "links": {
        "demo": "https://frc-scout.example.com",
        "repo": "https://github.com/gxu0904/frc-scouting"
      }
    },
    {
      "slug": "deca-event-scheduler",
      "name": "DECA Event Scheduler",
      "tagline": "Automated event scheduling system for chapter of 200+ members",
      "stack": ["Next.js", "TypeScript", "Prisma", "PostgreSQL", "Tailwind"],
      "year": "2023",
      "role": "Solo Developer",
      "description": "Built intelligent scheduling system for DECA business competitions, automatically generating conflict-free schedules for 500+ students across 40+ events while respecting room capacity, judge availability, and student preferences.",
      "highlights": [
        "Implemented constraint satisfaction algorithm handling complex scheduling requirements",
        "Reduced manual scheduling time from 20 hours to 2 minutes with automated conflict resolution",
        "Built judge and room management interface with drag-and-drop schedule adjustments",
        "Generated printable schedules, room assignments, and judge packets automatically",
        "Added real-time notifications for schedule changes via email and SMS"
      ],
      "metrics": [
        "500+ students scheduled",
        "40+ concurrent events",
        "20hrs → 2min scheduling time",
        "Zero scheduling conflicts"
      ],
      "links": {
        "repo": "https://github.com/gxu0904/deca-scheduler"
      }
    },
    {
      "slug": "portfolio-cli",
      "name": "CLI Portfolio",
      "tagline": "Interactive terminal-based portfolio website",
      "stack": ["Next.js 15", "TypeScript", "Tailwind CSS", "Framer Motion"],
      "year": "2024",
      "role": "Designer & Developer",
      "description": "Modern take on the classic terminal portfolio, built with Next.js 15 and optimized for performance and accessibility. Features command history, tab autocomplete, and a hidden Easter egg.",
      "highlights": [
        "Built custom CLI parser with command routing, argument validation, and error handling",
        "Implemented keyboard-first UX with arrow key history and tab autocomplete",
        "Achieved 95+ Lighthouse scores across all categories (Performance, Accessibility, SEO, Best Practices)",
        "Added smooth animations and transitions using Framer Motion while maintaining 60fps",
        "Fully responsive design adapting from mobile touch to desktop keyboard workflows"
      ],
      "metrics": [
        "95+ Lighthouse scores",
        "12 interactive commands",
        "< 100kb initial bundle",
        "60fps animations"
      ],
      "links": {
        "demo": "https://gxu0904.github.io",
        "repo": "https://github.com/gxu0904/gxu0904.github.io"
      }
    },
    {
      "slug": "market-analyzer",
      "name": "Market Sentiment Analyzer",
      "tagline": "ML-powered tool analyzing social media for market trends",
      "stack": ["Python", "scikit-learn", "React", "FastAPI", "Docker"],
      "year": "2023",
      "role": "Full-Stack Developer",
      "description": "Experimental project analyzing social media sentiment to identify emerging market trends and consumer preferences. Built for learning NLP and time-series analysis techniques.",
      "highlights": [
        "Implemented NLP pipeline processing 100K+ social media posts daily",
        "Built sentiment classification model achieving 82% accuracy on validation set",
        "Created interactive dashboard visualizing sentiment trends over time",
        "Designed RESTful API serving real-time and historical sentiment data",
        "Containerized application with Docker for easy deployment and scaling"
      ],
      "metrics": [
        "100K+ posts processed daily",
        "82% sentiment accuracy",
        "15+ data sources integrated",
        "Real-time trend detection"
      ],
      "links": {
        "repo": "https://github.com/gxu0904/market-analyzer"
      }
    }
  ]
}
